<?php

return [
    'required' => '空にすることはできません',
    'email' => '電子メールの形式が一致しません',
    'idCard' => 'ID カードの形式が一致しません',
    'url' => '有効な URL アドレスではありません',
    'number' => '数値である必要があります',
    'integer' => '整数である必要があります',
    'float' => '浮動小数点数でなければなりません',
    'mobile' => '形式が一致しません',
    'leng' => '長さが要件を満たしていません',
    'alpha' => '文字のみ使用可能',
    'alphaNum' => '英数字のみを使用できます',
    'alphaDash' => '文字、数字、アンダースコア_、ダッシュ-のみ',
    'chs' => '漢字のみ',
    'chsAlpha' => '漢字と文字のみ',
    'chsAlphaNum' => '漢字、文字、数字のみ',
    'chsDash' => '漢字、文字、数字、アンダースコア_、ダッシュ-のみ',
    'max' => '最大値は {max} のみ設定できます',
    'min' => '最小設定は {min} のみです',
    'twoDecimal' => '正の数値は小数点以下 2 桁まで可能です',
    'machine_port' => 'ポート番号は 1 ～ 65535 でなければなりません',
];